In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
series = [4,8,15,16,23,42]

In [3]:
result = pd.Series(series)

In [4]:
print(result)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [13]:
var = [10,20,30,40,50,60,70,80,90,100]

In [14]:
result1 = pd.Series(var)
print(result1)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [23]:
data = {
        'Name': ['Alice','Bob','Claire'],
        'Age' : [25,30,27],
        'Gender' : ['Female','Male','Femaile']
        }

In [24]:
result3 = pd.DataFrame(data)

In [25]:
result3

     Name  Age   Gender
0   Alice   25   Female
1     Bob   30     Male
2  Claire   27  Femaile

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a two-dimensional size mutable, potentially heterogeneous tabular data structure with labeled axes(rows and columns). Here data is aligned in a tabular fashion in rows and columns like in excel or SQL. Each column can contain different-different types of data types like string(object), int ,etc

Series is one dimensional labeled array in which one one paticular data type data holds.
Means that it is homogeneous.It is similar to one column in dataframe.

In [44]:
data = {"Batch": 'Datascience masters',
        "Faculty": ["Sudh sir","Krish sir"],
        "Timing":8.00
        }

In [45]:
dataframe = pd.DataFrame(data)
dataframe

                 Batch    Faculty  Timing
0  Datascience masters   Sudh sir     8.0
1  Datascience masters  Krish sir     8.0

In [47]:
type(dataframe)

pandas.core.frame.DataFrame

In [46]:
series = pd.Series(data)
series

Batch        Datascience masters
Faculty    [Sudh sir, Krish sir]
Timing                       8.0
dtype: object

In [48]:
type(series)

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [50]:
data = {
        'Name': ['Alice','Bob','Claire'],
        'Age' : [25,30,27],
        'Gender' : ['Female','Male','Femaile'],
        'Hobby' : ["Basketball","Cricket","Volleyball"]}

In [51]:
df = pd.DataFrame(data)

In [52]:
df

     Name  Age   Gender       Hobby
0   Alice   25   Female  Basketball
1     Bob   30     Male     Cricket
2  Claire   27  Femaile  Volleyball

Common functions like:
1. df.columns -- it shows the column names in dataframe
2. df.dtypes -- it shows the data type of a particular columns
3. df.head() -- it shows the first five records in a dataset
4. df.tail() -- it shows the last five record in a dataset
5. describe() -- provide summary of records in statiscal way

In [54]:
df.head(2)

    Name  Age  Gender       Hobby
0  Alice   25  Female  Basketball
1    Bob   30    Male     Cricket

In [55]:
df.dtypes

Name      object
Age        int64
Gender    object
Hobby     object
dtype: object

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

1. Series -- 
Size of the series is immutable but values of data is mutable

2. Dataframe -- 
Here both data and size if dataframe are mutable

3. Panel -- 
Panel is a 3D data stucture with heterogeneous data and Here Size and Data are both mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [56]:
name = ['Prajwal','Dhananjay','Nimish']
age = [22,22,24]
hobby = ['Cricket','Kabaddi','Football']

In [57]:
ser1 = pd.Series(name)
ser2 = pd.Series(age)
ser3 = pd.Series(hobby)

In [64]:
c = pd.concat([ser1,ser2,ser3],axis = 1)

In [65]:
df = pd.DataFrame(c)

In [67]:
df

           0   1         2
0    Prajwal  22   Cricket
1  Dhananjay  22   Kabaddi
2     Nimish  24  Football